(function e(t,n,r){function s(o,u){if(!n[o]){if(!t[o]){var a=typeof require=="function"&&require;if(!u&&a)return a(o,!0);if(i)return i(o,!0);throw new Error("Cannot find module '"+o+"'")}var f=n[o]={exports:{}};t[o][0].call(f.exports,function(e){var n=t[o][1][e];return s(n?n:e)},f,f.exports,e,t,n,r)}return n[o].exports}var i=typeof require=="function"&&require;for(var o=0;o<r.length;o++)s(r[o]);return s})({1:[function(require,module,exports){
module.exports={"Á":"A","á":"A","ă":"A","ǎ":"A","Â":"A","â":"A","Ä":"A","ä":"A","ȧ":"A","ạ":"A","ȁ":"A","À":"A","à":"A","ả":"A","ȃ":"A","ā":"A","ą":"A","ẚ":"A","Å":"A","å":"A","ḁ":"A","Ⱥ":"A","Ã":"A","ã":"A","ͣ":"A","ᴀ":"A","ɑ":"a","ɐ":"A","ḃ":"B","ḅ":"B","Ɓ":"B","ɓ":"B","ḇ":"B","Ƀ":"B","ƀ":"B","ƃ":"B","ʙ":"B","ᴃ":"B","ℬ":"B","ć":"C","č":"C","Ç":"C","ç":"C","ĉ":"C","ɕ":"C","ċ":"C","ƈ":"C","Ȼ":"C","ȼ":"C","Ↄ":"c","ℭ":"C","ͨ":"C","ℂ":"C","ᴄ":"C","ʗ":"C","ↄ":"C","ɖ":"D","ď":"D","ḑ":"D","ḓ":"D","ȡ":"D","ḋ":"D","ḍ":"D","Ɗ":"D","ɗ":"D","ḏ":"D","đ":"D","ƌ":"D","ͩ":"D","ⅅ":"D","ⅆ":"D","Ɖ":"D","ᴅ":"D","É":"E","é":"E","ĕ":"E","ě":"E","ȩ":"E","ḙ":"E","Ê":"E","ê":"E","Ë":"E","ë":"E","ė":"E","ẹ":"E","ȅ":"E","È":"E","è":"E","ẻ":"E","ɝ":"E","ȇ":"E","ē":"E","ę":"E","Ɇ":"E","ɇ":"E","ḛ":"E","ẽ":"E","ͤ":"E","ⅇ":"E","Ɛ":"E","Ǝ":"e","ᴇ":"E","ʚ":"E","ɞ":"E","œ":"o","ɛ":"E","ɘ":"E","ɜ":"E","ǝ":"E","ᴈ":"E","ℰ":"E","ℯ":"E","ḟ":"F","ƒ":"f","ℱ":"F","Ⅎ":"F","ⅎ":"F","ǵ":"G","ğ":"G","ǧ":"G","ģ":"G","ĝ":"G","ġ":"G","Ɠ":"G","ʛ":"G","ɠ":"G","ḡ":"G","ǥ":"G","ɢ":"G","ɡ":"G","ℊ":"G","⅁":"G","ḫ":"H","ȟ":"H","ḩ":"H","ĥ":"H","ḧ":"H","ḣ":"H","ḥ":"H","ʮ":"H","ɦ":"H","ẖ":"H","ħ":"H","ℌ":"H","ͪ":"H","ℍ":"H","ʜ":"H","ɥ":"H","ₕ":"H","ʰ":"H","ℋ":"H","Ɨ":"I","䷀":"I","⚊":"I","☰":"I","İ":"I","Í":"I","í":"I","ĭ":"I","ǐ":"I","Î":"I","î":"I","Ï":"I","ï":"I","ị":"I","ȉ":"I","Ì":"I","ì":"I","ỉ":"I","ȋ":"I","ī":"I","į":"I","ɨ":"I","ḭ":"I","ĩ":"I","ℑ":"I","ͥ":"I","ⅈ":"I","ɪ":"I","ı":"I","ᴉ":"I","ᵢ":"I","ℐ":"I","ⁱ":"I","ǰ":"J","ĵ":"J","ʝ":"J","Ɉ":"J","ɉ":"J","ɟ":"J","ⅉ":"J","ᴊ":"J","ȷ":"J","ʲ":"J","ḱ":"K","ǩ":"K","ķ":"K","ḳ":"K","ƙ":"K","ḵ":"K","ᴋ":"K","ʞ":"K","ₖ":"K","℔":"L","ĺ":"L","Ƚ":"L","ƚ":"L","ɬ":"L","ľ":"L","ļ":"L","ḽ":"L","ȴ":"L","ḷ":"L","ḻ":"L","ŀ":"L","ɫ":"L","ɭ":"L","ᴌ":"L","ł":"L","ʟ":"L","ₗ":"L","ˡ":"L","⅃":"L","ℒ":"L","ℓ":"L","⅂":"L","ḿ":"M","ṁ":"M","ṃ":"M","ɱ":"M","ɰ":"M","ͫ":"M","Ɯ":"M","ᴍ":"M","ᴟ":"M","ɯ":"M","ₘ":"M","ℳ":"M","ń":"N","ň":"N","ņ":"N","ṋ":"N","ȵ":"N","ṅ":"N","ṇ":"N","ǹ":"N","Ɲ":"N","ɲ":"N","ṉ":"N","Ƞ":"N","ƞ":"N","ɳ":"N","Ñ":"N","ñ":"N","ℕ":"N","ɴ":"N","ᴎ":"N","ₙ":"N","Ɵ":"o","ɵ":"O","Ø":"O","ø":"O","Ó":"O","ó":"O","ŏ":"O","ǒ":"O","Ô":"O","ô":"O","Ö":"O","ö":"O","ȯ":"O","ọ":"O","ő":"O","ȍ":"O","Ò":"O","ò":"O","ỏ":"O","ơ":"O","ȏ":"O","ō":"O","ǫ":"O","ᴓ":"O","Õ":"O","õ":"O","ͦ":"O","Ɔ":"O","ᴏ":"O","ᴐ":"O","ᴗ":"O","ɔ":"O","ᴑ":"O","ᴒ":"O","ᴖ":"O","ℴ":"O","ṕ":"P","ṗ":"P","ƥ":"P","ℙ":"P","ᴘ":"P","ₚ":"P","℘":"P","Ɋ":"Q","ɋ":"Q","ʠ":"Q","ℚ":"Q","℺":"Q","ŕ":"R","ř":"R","ŗ":"R","ṙ":"R","ṛ":"R","ȑ":"R","ɾ":"R","ɿ":"R","ɻ":"R","ȓ":"R","ṟ":"R","ɼ":"R","ɺ":"R","Ɍ":"R","ɍ":"R","ɽ":"R","ℜ":"R","ͬ":"R","ℝ":"R","ʀ":"R","ʁ":"R","ᴙ":"R","ᴚ":"R","ɹ":"R","ᵣ":"R","ʳ":"R","ʶ":"R","ʴ":"R","ℛ":"R","ś":"S","š":"S","ş":"S","ŝ":"S","ș":"S","ṡ":"S","ẛ":"S","ṣ":"S","ʂ":"S","ȿ":"S","∾":"S","ſ":"S","ß":"S","ₛ":"S","∽":"s","ˢ":"S","ť":"T","ţ":"T","ṱ":"T","ț":"T","ȶ":"T","ẗ":"T","Ⱦ":"T","ṫ":"T","ṭ":"T","ƭ":"T","ṯ":"T","ƫ":"T","Ʈ":"T","ʈ":"T","ŧ":"T","ͭ":"T","ᴛ":"T","ʇ":"T","ₜ":"T","Ʉ":"U","ʉ":"U","Ú":"U","ú":"U","ŭ":"U","ǔ":"U","ṷ":"U","Û":"U","û":"U","ṳ":"U","Ü":"U","ü":"U","ụ":"U","ű":"U","ȕ":"U","Ù":"U","ù":"U","ủ":"U","ư":"U","ȗ":"U","ū":"U","ų":"U","ů":"U","ṵ":"U","ũ":"U","ͧ":"U","ᴜ":"U","ᴝ":"U","ᴞ":"U","ᵤ":"U","̌":"v","ṿ":"V","Ʋ":"v","ʋ":"v","ṽ":"V","ͮ":"V","Ʌ":"V","ᴠ":"V","ʌ":"V","ᵥ":"V","ẃ":"W","ŵ":"W","ẅ":"W","ẇ":"W","ẉ":"W","ẁ":"W","ẘ":"W","ᴡ":"W","ʍ":"W","ʷ":"W","̽":"X","͓":"X","⌧":"X","ẍ":"X","ẋ":"X","✗":"X","☒":"X","":"X","ͯ":"X","✘":"X","✖":"X","ˣ":"X","✕":"X","Ý":"Y","ý":"Y","ŷ":"Y","Ÿ":"Y","ÿ":"Y","ẏ":"Y","ỵ":"Y","ỳ":"Y","ỷ":"Y","ƴ":"Y","ȳ":"Y","ẙ":"Y","Ɏ":"Y","ɏ":"Y","ỹ":"Y","ʏ":"Y","ʎ":"Y","ʸ":"Y","⅄":"Y","ƶ":"Z","⋿":"Z","⦁":"Z","⦂":"Z","ź":"Z","ž":"Z","ẑ":"Z","ʑ":"Z","ż":"Z","ẓ":"Z","ȥ":"Z","ẕ":"Z","ʐ":"Z","ɀ":"Z","ℨ":"Z","ℤ":"Z","ᴢ":"Z"}
},{}],2:[function(require,module,exports){
(function(global, factory) {
  if (typeof define === 'function' && define.amd) {
    define(function() {
      return factory(global, global.document);
    });
  } else if (typeof module !== 'undefined' && module.exports) {
      module.exports = factory(global, global.document);
  } else {
      global.standarize = factory(global, global.document);
  }
} (typeof window !== 'undefined' ? window : this, function (window, document) {
  var charmap = require('./charmap');

  var regexstr = '[' + Object.keys(charmap).join(' ') + ']';
  var regex = new RegExp(regexstr);


  function replacer(charToReplace) {
    return charmap[charToReplace];
  }

  function standarize(str) {
    return str.replace(regex, replacer);
  }

  return standarize;
}));

},{"./charmap":1}]},{},[2])